espressif/idf-extra-components/catch2/host_test/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10000
